micropython/micropython/ports/esp32/boards/UPESY_EDU_ESP32/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "uPesy EDU ESP32"
#define MICROPY_HW_MCU_NAME "ESP32"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "UP_EDU_ESP32"

#define MICROPY_HW_I2C0_SCL (22)
#define MICROPY_HW_I2C0_SDA (21)

#define MICROPY_HW_SPI1_SCK (18)
#define MICROPY_HW_SPI1_MOSI (23)
#define MICROPY_HW_SPI1_MISO (19)
